

{
  "passages": [
    {
      "text": "NARRATION\nWith the sapphire spyglass cutting through the fog and the amber lantern revealing the hidden contents of the map, your raft creeps up against the shoreline.\n\nCAPTAIN\nOh, how I've longed to set foot on ye once more, my dear island!\n\nNARRATION\nThe captain snatches the map and lantern from your hands and begins marching.\n\nCAPTAIN\nYer about to witness a sight few have had the privilege of seeing. No greater fortune has ever been amassed on the high seas.\n\nNARRATION\nThe march proceeds mostly in silence, a rare case for the captain in your journey so far.\n\nNARRATION\nTo your surprise, the captain begins to slow down. His steps are no longer full of the enthusiasm he had jumping off the raft.\n\nNARRATION\nFinally, he comes to a stop after catching sight the moon resting over the ocean horizon.\n\nCAPTAIN\n...\n\nCAPTAIN\nYer not getting the full experience here ye know.\n\nCAPTAIN\nYou pilot a miserable raft. Have you ever sailed with a full crew?\n\nCAPTAIN\nThe coordination is remarkable. Sea battles are strategy, but one can only strategize effectively when the crew is consistent and trained. Predators hunting prey.\n\nCAPTAIN\n...\n\nCAPTAIN\nBah! Small crew or large, the old crew chose to be looters! And here we are, a mere crew of two having accomplished what they failed to do!\n\nCAPTAIN\nI must admit. Ye would fare poorly in a sea battle.\n\nCAPTAIN\n...\n\nCAPTAIN\nAlone, I mean. A good sailor knows themselves and their mates form more than the sum of their parts.\n\nNARRATION\nIt’s clear the Captain has mulled over Leftpaw’s final words.\n\nCAPTAIN\n... ye should get a fishing buddy or something.\n\nCAPTAIN\nWhat am I saying? Get back to marching landlubber, break's over!\n\nNARRATION\nHe abruptly begins marching, returning his eyes to the map.\n\nCAPTAIN\nGold in the moonlight! That's what being a pirate is all about!\n\nNARRATION\nHe is completely ignoring you. Lost in his own mind.\n\nCAPTAIN\nThey couldn't earn their keep and decided to take it from their dear ol’ captain! Ha!\n\nCAPTAIN\nGreed! That's what did those bastards in and brought them to their watery grave!\n\n[[A watery grave like yours?]]\n",
      "links": [
        {
          "name": "A watery grave like yours?",
          "link": "A watery grave like yours?",
          "pid": "2"
        }
      ],
      "name": "Ending 1",
      "pid": "1",
      "position": {
        "x": "1075",
        "y": "500"
      }
    },
    {
      "text": "CAPTAIN\nDon't mistake me for a victim of my own greed like those others, scallywag! You may be daft but at least you're not a mutineer!\n\nCAPTAIN\nHeh, who gets the gold in the end? Me, that's who. The one who earned it!\n\n[[You didn't earn it alone.]]\n",
      "links": [
        {
          "name": "You didn't earn it alone.",
          "link": "You didn't earn it alone.",
          "pid": "3"
        }
      ],
      "name": "A watery grave like yours?",
      "pid": "2",
      "position": {
        "x": "1075",
        "y": "625"
      }
    },
    {
      "text": "CAPTAIN\nI earned my keep, and a crew needs a captain.\n\nCAPTAIN\nDo you know what those bastards were before I came along?\n\nCAPTAIN\nStreet urchins. Whelps. Drunks. The dregs of society.\n\nCAPTAIN\nEvery captain starts somewhere. Who wants to join an inexperienced captain?\n\nCAPTAIN\nI'll give you a hint. It's not the picks of the litter.\n\nCAPTAIN\nNo, I made them the crew they were. I invested time and care into my crew.\n\nCAPTAIN\nLong days and late nights. A captain who spends all his time in his quarters is the captain who loses his battles.\n\nCAPTAIN\nYou need a crew you can trust with your life.\n\n[[Guess that wasn't the crew you made then.]]",
      "links": [
        {
          "name": "Guess that wasn't the crew you made then.",
          "link": "Guess that wasn't the crew you made then.",
          "pid": "4"
        }
      ],
      "name": "You didn't earn it alone.",
      "pid": "3",
      "position": {
        "x": "1075",
        "y": "750"
      }
    },
    {
      "text": "NARRATION\nThe captain is dumbfounded. He stops his marching.\n\nCAPTAIN\nDon't tell me about my own crew, ye scallywag!\n\nCAPTAIN\nI taught them too well if anything! Once we could go for the big fish there was no looking back!\n\nCAPTAIN\nRoyal galleons. Merchant vessels. Literal treasure ships. The amount of gold was beyond anything I had promised them.\n\nCAPTAIN\nWhy shouldn't I get my fair share? They had more than enough of what they'd originally agreed to.\n\nCAPTAIN\nIn the beginning we had to run from sea fights! We flew up the black flag and if they didn't surrender we had to run for our lives!\n\nCAPTAIN\nIf Florrie couldn't help us flee into the reefs we'd have died a thousand times over!\n\nCAPTAIN\nAnd that's nothing if Leftpaw didn't find ways of keeping the ship afloat when god knows it took one too many cannonballs to the hull!\n\nCAPTAIN\nI remember one time we barely made it to land to do repairs, and what did we find on the deserted island we hit?\n\nCAPTAIN\nAnother recent shipwreck. Rum smugglers! They had been so drunk at sea they had run the ship aground!\n\nCAPTAIN\nWe all partied for days, until all the rum and rations were gone. What a fine time!\n\nCAPTAIN\nBy the end we had completely fogotten about the-\n\nNARRATION\nThe captain trails off.\n\nCAPTAIN\n...\n\nCAPTAIN\n\"It takes many islands to make an archipelago...\" heh.\n\nNARRATION\nHe seems to notice you again, his gaze focusses on you. \n\nCAPTAIN\nGet back to marching, landlubber. We could have bought twice the rum with the gold on the ship we escaped from back then!\n\n[[Florrie and Leftpaw didn't betray you.]]",
      "links": [
        {
          "name": "Florrie and Leftpaw didn't betray you.",
          "link": "Florrie and Leftpaw didn't betray you.",
          "pid": "5"
        }
      ],
      "name": "Guess that wasn't the crew you made then.",
      "pid": "4",
      "position": {
        "x": "1075",
        "y": "875"
      }
    },
    {
      "text": "NARRATION\nThe captain erupts into a raging stance.\n\nCAPTAIN\nThey were the closest crewmates I had! I trusted them with the security of this very island!\n\nCAPTAIN\nAnd in the end, they betrayed me!\n\n[[They sacrificed themselves for you.]]",
      "links": [
        {
          "name": "They sacrificed themselves for you.",
          "link": "They sacrificed themselves for you.",
          "pid": "6"
        }
      ],
      "name": "Florrie and Leftpaw didn't betray you.",
      "pid": "5",
      "position": {
        "x": "1075",
        "y": "1000"
      }
    },
    {
      "text": "CAPTAIN\nNonsense! Balderdash!\n\nCAPTAIN\nEven if that were true, they should have kept a better eye on the crew! Mutinies don't just happen you know!\n\n[[Gold and greed replaced you as captain.]]",
      "links": [
        {
          "name": "Gold and greed replaced you as captain.",
          "link": "Gold and greed replaced you as captain.",
          "pid": "7"
        }
      ],
      "name": "They sacrificed themselves for you.",
      "pid": "6",
      "position": {
        "x": "1075",
        "y": "1125"
      }
    },
    {
      "text": "CAPTAIN\n...\n\nCAPTAIN\nOh bugger it all.\n\nCAPTAIN\nI'm this close to my horde o' booty, and yer ruining it!\n\nCAPTAIN\nI can put them all behind me! What matter is it if they had less?\n\nCAPTAIN\nIf they didn't want more, they would have stopped sailing!\n\nCAPTAIN\nAnd if they stopped sailing, I wouldn't have a crew!\n\nCAPTAIN\nAnd if I didn't have a crew I'd be-\n\nCAPTAIN\n...\n\nCAPTAIN\nAll alone.\n\nCAPTAIN\nAll alone with me gold.\n\nNARRATION\nThe captain falls silent and in the distance you hear the crashing sounds of the waves.\n\nCAPTAIN\n...\n\nCAPTAIN\nI don't like to see it, but the real treasure I've lost is something doubloons can't buy.\n\nNARRATION\nThe captain looks over his incorporeal body.\n\nCAPTAIN\n...\n\nCAPTAIN\nIf you had to choose, would you pick a life or a legacy?\n\n[[Life.]]\n[[Legacy.]]\n",
      "links": [
        {
          "name": "Life.",
          "link": "Life.",
          "pid": "8"
        },
        {
          "name": "Legacy.",
          "link": "Legacy.",
          "pid": "9"
        }
      ],
      "name": "Gold and greed replaced you as captain.",
      "pid": "7",
      "position": {
        "x": "1075",
        "y": "1250"
      }
    },
    {
      "text": "CAPTAIN\nI guess me next question should be, \"would ye spend your life like a pirate squanders gold?\"\n\nNARRATION\nThe captain passes you the lantern and map.\n\n[[Take it.]]\n",
      "links": [
        {
          "name": "Take it.",
          "link": "Take it.",
          "pid": "10"
        }
      ],
      "name": "Life.",
      "pid": "8",
      "position": {
        "x": "1075",
        "y": "1375"
      }
    },
    {
      "text": "CAPTAIN\nHa! I suppose most do want to live beyond their lives. It's not what it's cracked up to be, I assure ye.\n\nNARRATION\nThe captain passes you the lantern and map.\n\n[[Take it.]]\n",
      "links": [
        {
          "name": "Take it.",
          "link": "Take it.",
          "pid": "10"
        }
      ],
      "name": "Legacy.",
      "pid": "9",
      "position": {
        "x": "1200",
        "y": "1375"
      }
    },
    {
      "text": "CAPTAIN\nYer getting a field promotion. For exceptional work at sea.\n\nCAPTAIN\nFrom swabbie to captain now. Better find someone to order around.\n\nCAPTAIN\nMaybe buying someone a drink with some of that gold would help?\n\nCAPTAIN\nTake it from a lonely captain. Buying folks a drink is a great way to gather up a crew at each port.\n\nCAPTAIN\n...\n\nCAPTAIN\nBetter yet, a great way to gather up others to grow closer to. Rum soothes the body and crew soothes the soul.\n\nCAPTAIN\nI had it and even when I almost lost it all, I went ahead and made sure I lost everything.\n\nCAPTAIN\nMe best mates. And I threw their lot in with those I would curse beyond the grave.\n\nCAPTAIN\nI'm through with it. I'm though with being a captain, and I'm through with being anything. I’ve had my time.\n\nCAPTAIN\nPromise me one thing. Spread the word of what happened to me and how I failed me crew. Let be a tale of caution.\n\nCAPTAIN\nBy the way, ye don’t get my hat. Wouldn’t give it to ye if I could.\n\nNARRATION\nHis ghostly body begins to fade, like Florrie and Leftpaw’s did.\n\nCAPTAIN\nMaybe... maybe I ought to try fishing?\n\nNARRATION\nYour captain is gone.\n\nNARRATION\nAt sea, command falls to those of the next highest rank. What are your orders, captain?\n\n[[Finish the march!]]\n\n[[Return to the boat.]]\n",
      "links": [
        {
          "name": "Finish the march!",
          "link": "Finish the march!",
          "pid": "11"
        },
        {
          "name": "Return to the boat.",
          "link": "Return to the boat.",
          "pid": "12"
        }
      ],
      "name": "Take it.",
      "pid": "10",
      "position": {
        "x": "1150",
        "y": "1500"
      }
    },
    {
      "text": "NARRATION\nYou barely walk a few meters before you see the entrance to a cave, the moonlight cutting through and revealing a golden glow.\n\nNARRATION\nYou step inside, and within is more gold than you possible could have imagined. The cave is wider and deeper than it appears from outside.\n\nNARRATION\nYou step inside, and within is more doubloons and pieces of eight than you possible could have imagined. The cave is wider and deeper than it appeared from outside.\n\nNARRATION\nIt'll take a few trips with your raft, but you figure you can go back and forth to accumulate enough to buy a ship of your own.\n\nNARRATION\nWith your magic lantern and spyglass it will be no trouble.\n\nNARRATION\nAs you lift the first handful of gold, you realize how heavy it is.\n\nNARRATION\nYou can't help but think - this would be easier with a crew. Perhaps you can break the ice with the tale of the Scarlet Siren and it's infamous Captain. \n\n[[END]]\n\n",
      "links": [
        {
          "name": "END",
          "link": "END",
          "pid": "13"
        }
      ],
      "name": "Finish the march!",
      "pid": "11",
      "position": {
        "x": "1150",
        "y": "1625"
      }
    },
    {
      "text": "NARRATION\n\"A pirate's life's not for me,\" you say to yourself.\n\nNARRATION\nYou turn around, then remember how excited you were to possibly catch a tuna earlier.\n\nNARRATION\n... and gold can buy a lot of tuna.\n\n[[Finish the march!]] ",
      "links": [
        {
          "name": "Finish the march!",
          "link": "Finish the march!",
          "pid": "11"
        }
      ],
      "name": "Return to the boat.",
      "pid": "12",
      "position": {
        "x": "1275",
        "y": "1625"
      }
    },
    {
      "text": "END",
      "name": "END",
      "pid": "13",
      "position": {
        "x": "1150",
        "y": "1750"
      }
    }
  ],
  "name": "Ending Scene",
  "startnode": "1",
  "creator": "Twine",
  "creator-version": "2.5.1",
  "ifid": "D00FE9CE-68F8-4027-9568-BAAFAB414D64"
}

