

{
  "passages": [
    {
      "text": "NARRATION\nYou sail upon a island with a mountain on it, as you crest around it, you notice there is a giant cave. \n\n[[Look at the cave]] \n[[Focus on rowing]]\n",
      "links": [
        {
          "name": "Look at the cave",
          "link": "Look at the cave",
          "pid": "2"
        },
        {
          "name": "Focus on rowing",
          "link": "Focus on rowing",
          "pid": "3"
        }
      ],
      "name": "RoSS 1",
      "pid": "1",
      "position": {
        "x": "800",
        "y": "350"
      }
    },
    {
      "text": "NARRATION\nFrom the distance you're at, you estimate that the cave could fit a warship in there.\n\nNARRATION\nAs you get draw closer to the shore you realize that your first guess was too generous, at most the cave could hide a longship.\n\nNARRATION\nIt begins to strike you how deeply perturbed that your \"Captain\" isn't helping row or guide your boat to shore - an extremely difficult task for a crew during this tide, let alone for one person.\n\nNARRATION\nYour thoughts are soon interrupted by a spray of briny white water that shakes your boat. Nothing too serious, but you focus your attention on not ending up as a ghost yourself.\n\n[[Focus on rowing]]\n\n",
      "links": [
        {
          "name": "Focus on rowing",
          "link": "Focus on rowing",
          "pid": "3"
        }
      ],
      "name": "Look at the cave",
      "pid": "2",
      "position": {
        "x": "750",
        "y": "500"
      }
    },
    {
      "text": "NARRATION\nYour ship closes on the shore and the captain hops out, though his feet don't leave a splash in the water as you'd expect leaving you with a sense of dissonance. \n\nNARRATION\nYou keep rowing the boat a little further and later hop into the water with a satisfying sploosh. You're wading forward ankle deep in sea water.\n\nNARRATION\nYou notice the captain is further ahead and that the water isn't slowing him down like it would a physical person. One of the scarce luxuries of being dead you presume.\n\nNARRATION\nDespite the lack of physical resistance for him, you notice how he still makes a conscious effort to keep is flintlocks away from the sea water.\n\nCAPTAIN\nWe're close to one of the filthy mutineers now. I can sense it. \n\nCAPTAIN\nI'm going to cleave that scurvy dog to the brisket... \n\nNARRATION\nThe water is low enough you now are walking, with your boots glopping at each step as they suction through the sand. Your ship being towed over your shoulder by a rope, following behind like a lazy ox. \n\nNARRATION\nIn the darkness you manage to see a ghastly orange light of similar intensity to the Captain’s green hue in the distance. \n\nCAPTAIN\nHeave ho! Put your back into it ye lazy landlubber. I've met freebooters that worked harder than ye. \n\n[[Argue]] \n[[Keep towing the boat]]\n",
      "links": [
        {
          "name": "Argue",
          "link": "Argue",
          "pid": "4"
        },
        {
          "name": "Keep towing the boat",
          "link": "Keep towing the boat",
          "pid": "5"
        }
      ],
      "name": "Focus on rowing",
      "pid": "3",
      "position": {
        "x": "950",
        "y": "650"
      }
    },
    {
      "text": "NARRATION\nAs you muster up the breath to argue with this feisty phantasm, you begin to calculate what backlash you'll face as a result. \n\nNARRATION\nAs you reach your conclusion, you resign yourself to responding with an \"aye\" - which, when your labours catch up to your thoughts, deflates to a meager sigh as you exhale.\n\nNARRATION\nYour eyes meet the sockets of the Captain and for a second you swear he raised and eyebrow at you. That is, if he had an eyebrow still left. \n\nNARRATION\nYou avert his gaze and hastily begin tying the rope around a sturdy palm tree. \n\n[[Anchor the rope around a tree]] \n\n",
      "links": [
        {
          "name": "Anchor the rope around a tree",
          "link": "Anchor the rope around a tree",
          "pid": "6"
        }
      ],
      "name": "Argue",
      "pid": "4",
      "position": {
        "x": "950",
        "y": "775"
      }
    },
    {
      "text": "NARRATION\nYou keep a steady pace and monitor your breath as you your ship slides out of the water and drags through the sand. \n\nNARRATION\nIt leaves behind a trench in the sand, one which you assume will be washed away in the next high high tide. \n\nNARRATION\nYou find a sturdy palm tree deep within the beach. This is a good spot.\n\n[[Anchor the rope around a tree]]\n\n",
      "links": [
        {
          "name": "Anchor the rope around a tree",
          "link": "Anchor the rope around a tree",
          "pid": "6"
        }
      ],
      "name": "Keep towing the boat",
      "pid": "5",
      "position": {
        "x": "1075",
        "y": "775"
      }
    },
    {
      "text": "CAPTAIN\nSink me! That's how ye tie a knot? Every old salt knows you loop twice, go through the middle and do one more loop to make a proper taut-line. \n\n\n[[Keep your knot as is]]\n[[Retie your knot the Captain's way]]\n\n\n",
      "links": [
        {
          "name": "Keep your knot as is",
          "link": "Keep your knot as is",
          "pid": "7"
        },
        {
          "name": "Retie your knot the Captain's way",
          "link": "Retie your knot the Captain's way",
          "pid": "8"
        }
      ],
      "name": "Anchor the rope around a tree",
      "pid": "6",
      "position": {
        "x": "1000",
        "y": "950"
      }
    },
    {
      "text": "NARRATION\nYou ignore the Captain's advice and keep your knot the way it is. What does he know? \n\nNARRATION\nAn annoyed click noise pops from his jaw. \n\nNARRATION\nAfter you do one last check to test it's effectiveness you look up to see the Captain facing towards the orange light. \n\n[[Walk toward the Captain]]\n\n",
      "links": [
        {
          "name": "Walk toward the Captain",
          "link": "Walk toward the Captain",
          "pid": "9"
        }
      ],
      "name": "Keep your knot as is",
      "pid": "7",
      "position": {
        "x": "925",
        "y": "1075"
      }
    },
    {
      "text": "NARRATION\nYou follow his advice and learn that can already feel the ease of sliding the knot to tighten or loosen. It appears very sturdy. \n\nNARRATION\nAs you look up you recieve a brief nod before the captain pivots toward the orange light. \n\n[[Walk toward the Captain]]",
      "links": [
        {
          "name": "Walk toward the Captain",
          "link": "Walk toward the Captain",
          "pid": "9"
        }
      ],
      "name": "Retie your knot the Captain's way",
      "pid": "8",
      "position": {
        "x": "1062.5",
        "y": "1075"
      }
    },
    {
      "text": "NARRATION\nYou begin to walk towards him and stumble as you almost trip over the rope. \n\nCAPTAIN\nIn future, put a rock over the rope to keep the line down. It's good for when the hearties drink a clap of thunder on a dark night. \n\nNARRATION\nFrom your angle you see what you believe to be the edges of a grin on his skeletal face. \n\nCAPTAIN\n...\n\nCAPTAIN\nShiver me timbers! Hurry up, will you? \n\n\nNARRATION\nHe sets off in the lead and you begin your trek toward the orange glow.\n\nNARRATION\nAs you near the figure you start to discern a mostly human shape - the only difference is a ball of ethereal glowing amber light in the stead of a head. \n\nNARRATION\nYou observe a wide array of tools on this individual, everything from hammers, chisels, and most prominently, a saw. \n\nNARRATION\nThere is a frenetic and spontaneous pacing from the orange ghoul like a fish in a school; safe and purposeful, yet still anxious.\n\nCAPTAIN\nLeftpaw! You... \n\nNARRATION\nYou see the orange phantom snap to attention in a salute with his left palm facing down. \n\nNARRATION\nLike a jellyfish readying itself to move, you swear you could see pride inflating his ethereal chest. \n\n\nLEFTPAW\nCap'n!\n\nCAPTAIN\n...son of a biscuit eater - you scurvy dog! I will give ye no quarter!!\n\nNARRATION\nAs quick as it came so to did it go. Leftpaw deflated faster than a beached jellyfish.\n \nNARRATION\nHis amber glow a hue closer to a red now. His arm now slumping limp at his side.\n\nLEFTPAW\n'Scuze me Cap'n? \n\nNARRATION\nYou notice a spectral flintlock in the Captain's hands now. There is a subtle tremble in his grip.\n\nCAPTAIN\nI will never, NEVER, forgive ye, yer a mutinous cur!\n\nLEFTPAW\nForgive me? Yer the one who left me to Davy Jones' locker!\n\nLEFTPAW\nThe Cap'n is supposed to go down with the ship! Where were ye when the Siren sunk to the briny deep? \n\nLEFTPAW\nThe Siren was a loyal lass and ye left her behind on a dinghy! What cap'n are ye? She deserved better!\n\nCAPTAIN\nAye, she was a loyal and reliable lass - unlike you - when you scuttled her! \n\n\nLEFTPAW \nI was too busy repairing her hull and keeping bilge out to notice what the crew was doing. What sort of shipwright do you take me for?\n\nLEFTPAW\nYer are my bruvva cap’n. I am always grateful ye gave me a 'ome and a sense of being part of somethin'...\n\nLEFTPAW\n...and now ye accuse me of BETRAYING YE? OF SCUTTLING, ME 'OME, THE SCARLET SIREN ?\n\nNARRATION\nThe Captain folded his arms across his chest. His hand still gripping a flintlock.\n\nCAPTAIN\nPft, are you trying to run a rig on me Otto? \n\nLEFTPAW\nThere's a name I 'adn't 'eard in awhile. Well Cap'n, or should I say //Cedric, // do you even know why I followed? It wasn’t for the doubloons or the bounty.\n\nLEFTPAW\nI was there from the beginning with ye. You were once the paragon of piracy, eh? It's a right pity seeing where ye are now. \n\nCAPTAIN\nAt least I'm getting closer to the booty while ye haplessly pace around like a landlubber out to hornswaggle! \n\n\nLEFTPAW\n'aplessly? I'm trying to put the Siren back together! She deserves dignity, even at the bottom of the deep. \n\nCAPTAIN\nIf yer still loyal to me, then hand over the lantern Otto. Prove yer still me Leftpaw, lest ye be a bilge-sucker. \n\nLEFTPAW\nProve to me that ye still care about the Siren and the lantern is all yours.\n\nNARRATION\nThe Captain moves to ready his flintlock once more.\n\nNARRATION\nLeftpaw raises his hands in resignation and faces you. \n\nLEFTPAW THE BILGERAT\nLook, ye seem to 'ave an even keel. The only thing left I need to find is the 'elm. The cockswain 'ould've also 'anted it in its rightful place. \n\n\n[[Ok, I'll get on it]] \n[[*stiffle a giggle* Cockswain?]]\n\n\n\n\n",
      "links": [
        {
          "name": "Ok, I'll get on it",
          "link": "Ok, I'll get on it",
          "pid": "11"
        },
        {
          "name": "*stiffle a giggle* Cockswain?",
          "link": "*stiffle a giggle* Cockswain?",
          "pid": "10"
        }
      ],
      "name": "Walk toward the Captain",
      "pid": "9",
      "position": {
        "x": "1000",
        "y": "1250"
      }
    },
    {
      "text": "NARRATION\nBoth the Captain and Leftpaw look at you with an expression of ghastly shock. They quickly exchange a glance.\n\nLEFTPAW\nShivver me timbers, yer serious?\n\nCAPTAIN\nA cockswain is a helmsmen ye scallywag! What do they put in landlubber books these days?\n\nNARRATION\nIt appears your own incompetence to see beyond the veil of child-like immaturity is the only thing that can suprise spirits who have seen beyond the veil of mortaility.\n\nNARRATION\nFor once tonight, the two actually agreed on something. \n\n[[Ok, I'll get on it]]\n\n",
      "links": [
        {
          "name": "Ok, I'll get on it",
          "link": "Ok, I'll get on it",
          "pid": "11"
        }
      ],
      "name": "*stiffle a giggle* Cockswain?",
      "pid": "10",
      "position": {
        "x": "1125",
        "y": "1375"
      }
    },
    {
      "text": "NARRATION\nYou set out to find the missing helm of the Scarlet Siren. You hear the Captain and Leftpaw resume arguing in the distance.\n\n[[Search the beach]] \n[[Search the cave ]]\n\n",
      "links": [
        {
          "name": "Search the beach",
          "link": "Search the beach",
          "pid": "12"
        },
        {
          "name": "Search the cave ",
          "link": "Search the cave ",
          "pid": "13"
        }
      ],
      "name": "Ok, I'll get on it",
      "pid": "11",
      "position": {
        "x": "975",
        "y": "1500"
      }
    },
    {
      "text": "NARRATION\nUsing the orange and green glow of the ghosts as a point of reference to navigate, you scour all around beach.\n\nNARRATION\nNo matter how far away you were, the sound of the two arguing managed to always be vageuly audible.\n\nNARRATION\nAlas, it is to no avail.\n\n[[Search the cave ]] \n\n\n",
      "links": [
        {
          "name": "Search the cave ",
          "link": "Search the cave ",
          "pid": "13"
        }
      ],
      "name": "Search the beach",
      "pid": "12",
      "position": {
        "x": "975",
        "y": "1625"
      }
    },
    {
      "text": "NARRATION\nYou find the beachead closest to the cave and follow a river inward. You creep further into the darkness, your steps echoing throughout the cave. \n\nNARRATION\nYou follow the sound of the water, sometimes accidentally slpping into it, until you see a feint light in the distance. It grows brighter and brigher and the tunnel opens into a larger cavern.\n\nNARRATION\nYou are surprised to be in a well-lit lagoon. You notice the pale and bright moonlight pierces through holes in the mountain that eroded over the eons and reflects off the water. \n\nNARRATION\nGently brushing agaisnt this private beach is the wheel of a ship. You set out to return to the two arguing ghosts by restracing your steps backwards.\n\nLEFTPAW\nI see ye found it. Good work matey. \n\nLEFTPAW\nNow return it to the deep. \n\nNARRATION\nLeftpaw motions towards the sea. \n\n[[Throw it as hard as you can]]\n[[Throw it as stylishly as you can]]\n\n",
      "links": [
        {
          "name": "Throw it as hard as you can",
          "link": "Throw it as hard as you can",
          "pid": "14"
        },
        {
          "name": "Throw it as stylishly as you can",
          "link": "Throw it as stylishly as you can",
          "pid": "15"
        }
      ],
      "name": "Search the cave ",
      "pid": "13",
      "position": {
        "x": "1125",
        "y": "1625"
      }
    },
    {
      "text": "NARRATION\nYou take the helm with both hands and use your entire body weight while throwing it in an arc to gain centrifugal momentum. \n\nNARRATION\nThe helm flies deep and far into the dark sea and makes a very satisfying sploosh sound. White water and mist glistens in the moonlight. \n\nNARRATION\nYou turn to see the reaction of your two ghostly companions just in time to see the Captain making an odd gesture with his boney jaw. \n\n\nLEFTPAW\n…Did ye just try to whistle Cap’n? Without any lips? \n\nCAPTAIN\nI -\n\nLEFTPAW\nHahahahahahaha!\n\nCAPTAIN\n….ha…haha…hahahahaha!\n\nNARRATION\nThe two chuckle and giggle on and off as they try to regain their composure. The Captain puts his hand on Leftpaw’s shoulder. \n\nLEFTPAW\nLook at us now, eh? A couple of wretched ghouls. \n\nCAPTAIN\n…\n\nNARRATION\nA moment of sobriety washes over them both. The Captain's hand pulls away from Leftpaw.\n\nLEFTPAW\nAhh… \n\nNARRATION\nLeftpaw’s glow starts to fade – the light diminishing with each passing seconds. \n\nLEFTPAW\nI think me times up cap’n. Look, I know we didn’t always agree in life, and we certainly aren’t agreeing in death. \n\nLEFTPAW\nI want ye to know that I hope ye find what it is yer truly lookin’ for on this course yer sailing. \n\nLEFTPAW\nJust remember, it doesn’t matter how big the island is, it takes many islands to make an archipelago. \n\nNARRATION\nLeftpaw looks back towards you. \n\nLEFTPAW\nA bargain is a bargain. The Scarlet Siren is whole again. My lantern is yours… and… thank ye. \n\nNARRATION\nThe remainder of what was Otto “Leftpaw” the Bilgerat disintegrates into a swarm of ember-like motes adrift across the sky. \n\nNARRATION\nLike fireflies dancing over the ocean and across the night sky. Slowly flickering out one by one as they landed in the water. \n\nNARRATION\nYou feel a gentle nudge at your feet, and as you look down you notice the waves brought in the amber lantern.\n\nCAPTAIN\n…\n\nCAPTAIN\nAvast Ye! Back to the ship. Captain’s orders!\n",
      "name": "Throw it as hard as you can",
      "pid": "14",
      "position": {
        "x": "1125",
        "y": "1750"
      }
    },
    {
      "text": "NARRATION\nYou take a running start toward the water with the helm in both hands. In your mind you plan on jumping while throwing the helm and landing with a double backflip into a recovering somersault.\n\nNARRATION\nAs you jump up, your boot gets stuck in the sand but it’s too late you’re already committed. The helm spirals off in a random direction while you fall back down.\n\nNARRATION\nYou land face first into the beach as a wave hits you and washes over you. You hear a very unsatisfying splish sound as the helm lands nearby. \n\nNARRATION\nThe seawater in your eyes is disorienting and you think you can see the helm being pulled out by the sea. \n\nNARRATION\nYou waddle back toward your two ghostly companions with little dignity in tact. \n\nLEFTPAW\nYer new swabbie reminds me of that clumsy young stowaway who we gave their first swig o’ rum to! ‘member that? \n\nCAPTAIN\nI -\n\nLEFTPAW\nHahahahahahaha!\n\nCAPTAIN\n….ha…haha…hahahahaha!\n\nNARRATION\nThe two chuckle and giggle on and off as they try to regain their composure. The Captain puts his hand on Leftpaw’s shoulder. \n\nLEFTPAW\nLook at us now, eh? A couple of wretched ghouls. \n\nCAPTAIN\n…\n\nNARRATION\nA moment of sobriety washes over them both. The Captain's hand pulls away from Leftpaw.\n\nLEFTPAW\nAhh… \n\nNARRATION\nLeftpaw’s glow starts to fade – the light diminishing with each passing seconds. \n\n\nLEFTPAW\nI think me times up cap’n. Look, I know we didn’t always agree in life, and we certainly aren’t agreeing in death. \n\nLEFTPAW\nI want ye to know that I hope ye find what it is yer truly lookin’ for on this course yer sailing. \n\nLEFTPAW\nJust remember, it doesn’t matter how big the island is, it takes many islands to make an archipelago. \n\nNARRATION\nLeftpaw looks back towards you. \n\nLEFTPAW\nA bargain is a bargain. The Scarlet Siren is whole again. My lantern is yours… and… thank ye. \n\nNARRATION\nThe remainder of what was Otto “Leftpaw” the Bilgerat disintegrates into a swarm of ember-like motes. \n\nNARRATION\nLike fireflies dancing over the ocean and across the night sky. Slowly flickering out one by one as they landed in the water. \n\nNARRATION\nYou feel a gentle nudge at your feet, and as you look down you notice the waves brought in the amber lantern.\n\nCAPTAIN\n…\n\nCAPTAIN\nAvast Ye! Back to the ship. Captain’s orders!\n",
      "name": "Throw it as stylishly as you can",
      "pid": "15",
      "position": {
        "x": "1250",
        "y": "1750"
      }
    }
  ],
  "name": "Shipwright",
  "startnode": "1",
  "creator": "Twine",
  "creator-version": "2.5.1",
  "ifid": "AF273AC8-2FAA-4F60-BF27-DF313C0B748F"
}

